
//==============================================================================//
//	Z80 Single Board Computer "PC-84C0SD 20MHz" I/O Sketch for ESP32-S3-MINI-1	//
//				Implemented by Shisuibi --Grand Master Sorcerian--				//
//==============================================================================//


//==============================================================================//
#include	<BLEDevice.h>								//	BLEDeviceライブラリ
#include	<SPIFFS.h>									//	SPIFFSライブラリ
//------------------------------------------------------------------------------//
#define		SDFAT_FILE_TYPE				1				//	FAT形式（FAT16/FAT32）
#include	<SdFat.h>									//	SdFatライブラリ
//------------------------------------------------------------------------------//
#include	<LovyanGFX.hpp>								//	LovyanGFXライブラリ
//==============================================================================//


//==============================================================================//
#define		UpperDefinition
//==============================================================================//


//==============================================================================//
#include	"LgfxUser.hpp"								//	LGFXユーザー設定インスタンス
#include	"RomImage.h"								//	IPL & Microsoft BASIC
#include	"Function.h"								//	定義ファイル（基本機能）
//------------------------------------------------------------------------------//
#include	"Multi.h"									//	定義ファイル（M/S相互通信）
#include	"Clock.h"									//	定義ファイル（クロック）
#include	"Trans.h"									//	定義ファイル（シリアル通信）
#include	"CpmEmu.h"									//	定義ファイル（CP/M模倣）
//------------------------------------------------------------------------------//
#include	"Matrix.h"									//	定義ファイル（幾何学演算）
#include	"Vport.h"									//	定義ファイル（仮想入出力）
#include	"Reset.h"									//	定義ファイル（リセット）
#include	"SpiLcd.h"									//	定義ファイル（液晶表示）
//==============================================================================//


//==============================================================================//
#undef		UpperDefinition
//------------------------------------------------------------------------------//
#define		LowerDefinition
//==============================================================================//


//==============================================================================//
#include	"LgfxUser.hpp"								//	LGFXユーザー設定インスタンス
#include	"RomImage.h"								//	IPL & Microsoft BASIC
#include	"Function.h"								//	定義ファイル（基本機能）
//------------------------------------------------------------------------------//
#include	"Multi.h"									//	定義ファイル（M/S相互通信）
#include	"Clock.h"									//	定義ファイル（クロック）
#include	"Trans.h"									//	定義ファイル（シリアル通信）
#include	"CpmEmu.h"									//	定義ファイル（CP/M模倣）
//------------------------------------------------------------------------------//
#include	"Matrix.h"									//	定義ファイル（幾何学演算）
#include	"Vport.h"									//	定義ファイル（仮想入出力）
#include	"Reset.h"									//	定義ファイル（リセット）
#include	"SpiLcd.h"									//	定義ファイル（液晶表示）
//==============================================================================//


//==============================================================================//
#undef		LowerDefinition
//==============================================================================//
